---
type: TemperatureRatingTypeSetIterator
namespace: Autodesk.Revit.DB.Electrical
version: 2024
members: 4
tags: [revit-api, class]
---

# TemperatureRatingTypeSetIterator

`Autodesk.Revit.DB.Electrical.TemperatureRatingTypeSetIterator` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | TemperatureRatingTypeSetIterator | — | `public TemperatureRatingTypeSetIterator ()` |
| Method | MoveNext | — | `public virtual bool MoveNext ()` |
| Method | Reset | — | `public virtual void Reset ()` |
| Property | Current | — | `public virtual Object Current { get ; }` |